## Importing Libraries

In [40]:
import pandas as pd

## Loading Dataset

In [41]:
master_data = pd.read_excel("Master_data_excel.xlsx")
cricket_data = pd.read_excel("Cricket.xlsx")
hockey_data = pd.read_excel("Hockey.xlsx")
volley_data = pd.read_csv("Volleyball.csv")

In [42]:
master_data_dict = master_data.to_dict()

In [43]:
# master_data_dict

In [44]:
# master_data

## Assignment Questions

#### 1.	Print master data and data of all the participant separately

In [45]:
for i in range(10):
    print(f"{master_data_dict['ID'][i]} {master_data_dict['NAME'][i]} {master_data_dict['AGE'][i]}")

A001 HARTEJ SINGH ASSI 23
A002 BHAVESH BALDANIYA 35
A003 YASH BAVISHI 22
A004 SHREEKARA BHAT 34
A005 KUNAL BHATT 31
A006 DARRYL CARDOZA 26
A007 SURESH CHAUDHARY 28
A009 CHIRAG CHOUDHARY 40
A010 YASH CHOWDHARI 45
A011 MIHIR DHANGDHARIYA 33

#### 2.	Want the list of employees who participated in all the events with complete informaton

In [46]:
id_cric = set(cricket_data['ID'])
id_hockey = set(hockey_data['ID'])
id_volley = set(volley_data['ID'])

intersect_id = id_cric.intersection(id_hockey, id_volley)

In [47]:
intersect_id

{'A005',
 'A013',
 'A018',
 'A026',
 'A042',
 'A045',
 'A048',
 'A053',
 'A057',
 'A062',
 'A063',
 'L011',
 'L040',
 'L043'}

In [48]:
[master_data[master_data['ID'] == id_] for id_ in intersect_id]

[      ID         NAME LOCATION        DEPT  AGE
 37  A042  PARTH SURVE    Delhi  technology   40,
       ID          NAME LOCATION       DEPT  AGE
 43  A048  MIHIR SAWANT   Nagpur  marketing   30,
       ID         NAME LOCATION        DEPT  AGE
 11  A013  ANIKET GAMI   Indore  production   42,
       ID           NAME  LOCATION        DEPT  AGE
 23  A026  NIDHI MADNANI  Hydrabad  technology   38,
       ID             NAME LOCATION       DEPT  AGE
 51  A057  MADHURAM SHUKLA   Nagpur  marketing   37,
       ID         NAME LOCATION        DEPT  AGE
 66  L011  ADITYA JAIN     Pune  production   29,
       ID            NAME LOCATION       DEPT  AGE
 55  A062  HARSHIT THAPAR   Nagpur  marketing   35,
       ID          NAME LOCATION        DEPT  AGE
 40  A045  MUDIT POTDAR   Nagpur  technology   37,
       ID            NAME LOCATION   DEPT  AGE
 47  A053  HUSSAIN SHAIKH   Nagpur  sales   23,
       ID          NAME LOCATION   DEPT  AGE
 56  A063  ABHAY TIWARI   Mumbai  sales   33,
      ID         NAME LOCATION        DEPT  AGE
 4  A005  KUNAL BHATT   Mumbai  technology   31,
       ID         NAME LOCATION        DEPT  AGE
 16  A018  ISHWAR IYER    Delhi  production   29,
       ID           NAME LOCATION       DEPT  AGE
 86  L040  RITIKA SHETTY   Mumbai  marketing   37,
       ID            NAME LOCATION   DEPT  AGE
 89  L043  YASH CHAUDHARI   Indore  sales   24]

#### 3.	How many employees have participated in only one event with name and id?

In [74]:
only_cricket = id_cric - set(list(id_cric.intersection(id_volley)) + list(id_cric.intersection(id_hockey)) + list(intersect_id))
only_volley = id_volley - set(list(id_volley.intersection(id_cric)) + list(id_volley.intersection(id_hockey)) + list(intersect_id))
only_hockey = id_hockey - set(list(id_hockey.intersection(id_cric)) + list(id_hockey.intersection(id_volley)) + list(intersect_id))

print("Only for Cricket {}".format(only_cricket))
print("Only for Volley {}".format(only_volley))
print("Only for Hockey {}".format(only_hockey))

Only for Cricket {'A012', 'A049', 'A034', 'A050', 'A032', 'A033', 'A047', 'L035', 'A037'}
Only for Volley {'A067', 'A024', 'A054', 'A028'}
Only for Hockey {'A038', 'L016', 'A036', 'A004', 'L039', 'A056', 'A003', 'A014', 'L005', 'L021', 'A025'}

In [64]:
len(list(only_cricket) + list(only_hockey) + list(only_volley))

24

#### 4. Want to understand most active department in sports

In [51]:
master_data.loc[max(master_data['DEPT'].value_counts())].DEPT

'sales'

#### 5. 	Want the details of youngest and eldest employee who participated in all the events

In [52]:
master_data.loc[master_data['AGE'] == max(master_data.AGE)]

      ID            NAME LOCATION        DEPT  AGE
52  A058     ANMOL SINHA    Delhi  production   49
60  A067   NIDHI AGRAWAL   Mumbai   marketing   49
70  L017   SANJANA MEHTA   Indore  technology   49
78  L029     MAYUR PAWAR   Indore       sales   49
87  L041  RUSHABH JADHAV     Pune  production   49

In [53]:
master_data.loc[master_data['AGE'] == min(master_data.AGE)]

      ID              NAME LOCATION        DEPT  AGE
2   A003      YASH BAVISHI    Delhi  production   22
15  A017  AGHA AYAAN HYDER     Pune  production   22

#### 6. 	Which city has maximum participation?

In [54]:
master_data.loc[max(master_data['LOCATION'].value_counts())].LOCATION

'Pune'

#### 7.	List of employees participated in all events from mumbai

In [57]:
from_mumbai = master_data[master_data.LOCATION == 'Mumbai']
mumbai_id = from_mumbai['ID']

In [58]:
participated_in_all = set(mumbai_id).intersection(intersect_id)
participated_in_all

{'A005', 'A063', 'L040'}

In [59]:
[from_mumbai[from_mumbai['ID'] == id_] for id_ in participated_in_all]

[      ID           NAME LOCATION       DEPT  AGE
 86  L040  RITIKA SHETTY   Mumbai  marketing   37,
       ID          NAME LOCATION   DEPT  AGE
 56  A063  ABHAY TIWARI   Mumbai  sales   33,
      ID         NAME LOCATION        DEPT  AGE
 4  A005  KUNAL BHATT   Mumbai  technology   31]

#### 8.	Name and Age of all the employees participation in cricket from pune

In [60]:
from_pune = master_data[master_data['LOCATION'] == 'Pune']
pune_id = from_pune['ID']

In [61]:
pune_cricket = set(pune_id).intersection(only_cricket)
pune_cricket

{'A012', 'A037'}

In [62]:
[from_pune[from_pune['ID'] == id_] for id_ in pune_cricket]

[      ID            NAME LOCATION       DEPT  AGE
 33  A037  AMEY NIMBALKAR     Pune  marketing   35,
       ID          NAME LOCATION       DEPT  AGE
 10  A012  SANKET GADGE     Pune  marketing   33]